Revit 2027 API
IFCParameterTemplate.ExportRevitMaterialParameters Property
 The option to export Revit material parameters to IFC. If true, then all Revit material parameters not excluded will be exported. If false, then no Revit material parameters will be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportRevitMaterialParameters { get; set; }
Public Property ExportRevitMaterialParameters As Boolean
	Get
	Set
public:
property bool ExportRevitMaterialParameters {
	bool get ();
	void set (bool value);
}
member ExportRevitMaterialParameters : bool with get, set
Property Value
Boolean
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace